docs/testing/jmeter/04_login.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FYP Mall - Login" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="BASE_PROTOCOL" elementType="Argument"><stringProp name="Argument.name">BASE_PROTOCOL</stringProp><stringProp name="Argument.value">http</stringProp></elementProp><elementProp name="BASE_HOST" elementType="Argument"><stringProp name="Argument.name">BASE_HOST</stringProp><stringProp name="Argument.value">34.143.225.11</stringProp></elementProp><elementProp name="BASE_PORT" elementType="Argument"><stringProp name="Argument.name">BASE_PORT</stringProp><stringProp name="Argument.value">80</stringProp></elementProp><elementProp name="API_PREFIX" elementType="Argument"><stringProp name="Argument.name">API_PREFIX</stringProp><stringProp name="Argument.value">/api</stringProp></elementProp><elementProp name="USERNAME" elementType="Argument"><stringProp name="Argument.name">USERNAME</stringProp><stringProp name="Argument.value">user</stringProp></elementProp><elementProp name="PASSWORD_MD5" elementType="Argument"><stringProp name="Argument.name">PASSWORD_MD5</stringProp><stringProp name="Argument.value">e10adc3949ba59abbe56e057f20f883e</stringProp></elementProp></collectionProp></elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Login Smoke Users" enabled="true"><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">${__P(LOOPS,1)}</stringProp></elementProp><stringProp name="ThreadGroup.num_threads">${__P(THREADS,1)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,1)}</stringProp><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp></ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json;charset=utf-8</stringProp></elementProp></collectionProp></HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Login" enabled="true"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;username&quot;:&quot;${USERNAME}&quot;,&quot;password&quot;:&quot;${PASSWORD_MD5}&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp><stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp><stringProp name="HTTPSampler.protocol">${BASE_PROTOCOL}</stringProp><stringProp name="HTTPSampler.path">${API_PREFIX}/login</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy>
        <hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert JSON code 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="0">&quot;code&quot;:&quot;200&quot;</stringProp></collectionProp><stringProp name="Assertion.custom_message"></stringProp><stringProp name="Assertion.test_field">Assertion.response_data</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion><hashTree/><JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Token" enabled="true"><stringProp name="JSONPostProcessor.referenceNames">TOKEN</stringProp><stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp><stringProp name="JSONPostProcessor.match_numbers">1</stringProp><stringProp name="JSONPostProcessor.defaultValues">TOKEN_NOT_FOUND</stringProp></JSONPostProcessor><hashTree/></hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>